# Aula 1 - Análise de Dados com Pandas

    Ensinar a carregar arquivos CSV no Google Colab, realizar leitura e visualização inicial de dados com Pandas. O aluno começará a manipular bases reais de dados com comandos simples de análise.

## Imports de bibliotecas

In [1]:
import pandas as pd

## Import de dados

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

df.head() # Por padrão mostra as 5 primeiras linhas da base de dados

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

### Mostra as informações da base de dados

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

### Mostra algumas estátisticas da base de dados

In [4]:
df.describe() # Para ver estatísticas descritivas de colunas numéricas

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

### Verificar a dimensão da base de dados

In [5]:
linhas, colunas = df.shape[0], df.shape[1]
print("Linhas:", linhas)
print("Colunas:", colunas)

Linhas: 133349
Colunas: 11

### Mostrar as colunas do dataframe

In [6]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

### Renomear as colunas para portugues brasileiro

In [7]:
renomear_colunas = {
    'work_year': 'ano',
    'experience_level': 'nivel_experiencia',
    'employment_type': 'contrato_emprego',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda_do_salario',
    'salary_in_usd': 'salario_em_usd',
    'employee_residence': 'residencia_empregado',
    'remote_ratio': 'tipo_trabalho',
    'company_location': 'localizacao_empresa',
    'company_size': 'tamanho_empresa'
}

df.rename(columns=renomear_colunas, inplace=True)
df.columns

Index(['ano', 'nivel_experiencia', 'contrato_emprego', 'cargo', 'salario',
       'moeda_do_salario', 'salario_em_usd', 'residencia_empregado',
       'tipo_trabalho', 'localizacao_empresa', 'tamanho_empresa'],
      dtype='object')

### Renomear algumas categorias para melhor compreensão dos dados

In [8]:
renomear_nivel_experiencia = {
    'SE': 'Sênior',
    'MI': 'Pleno',
    'EN': 'Junior',
    'EX': 'Executivo'
}

df["nivel_experiencia"] = df["nivel_experiencia"].replace(renomear_nivel_experiencia)

renomear_contrato_emprego = {
    'FT': 'Tempo Integral',
    'PT': 'Meio Período',
    'CT': 'Contrato',
    'FL': 'Freelancer'
}

df["contrato_emprego"] = df["contrato_emprego"].replace(renomear_contrato_emprego)

renomear_tipo_trabalho = {
    0: 'Presencial',
    50: 'Híbrido',
    100: 'Remoto'
}

df["tipo_trabalho"] = df["tipo_trabalho"].replace(renomear_tipo_trabalho)

renomear_tamanho_empresa = {
    'S': 'Pequena',
    'M': 'Média',
    'L': 'Grande'
}
df["tamanho_empresa"] = df["tamanho_empresa"].replace(renomear_tamanho_empresa)

### Verificar a frequencia de cada categoria dentro da coluna nivel_experiencia

In [9]:
df["nivel_experiencia"].value_counts() 

# O método value_counts() do Pandas retorna a contagem de ocorrências de cada valor único em uma coluna de um DataFrame. Ou seja, ele mostra quantas vezes cada
# categoria aparece naquela coluna, ordenando do mais frequente para o menos frequente.

nivel_experiencia
Sênior       77241
Pleno        40465
Junior       12443
Executivo     3200
Name: count, dtype: int64

### Verificar a frequencia de cada categoria dentro da coluna contrato_emprego

In [10]:
df["contrato_emprego"].value_counts()

contrato_emprego
Tempo Integral    132563
Contrato             394
Meio Período         376
Freelancer            16
Name: count, dtype: int64

### Verificar a frequencia de cada categoria dentro da coluna tipo_trabalho

In [11]:
df["tipo_trabalho"].value_counts()

tipo_trabalho
Presencial    105312
Remoto         27718
Híbrido          319
Name: count, dtype: int64

### Verificar a frequencia de cada categoria dentro da coluna tamanho_empresa

In [12]:
df["tamanho_empresa"].value_counts()

tamanho_empresa
Média      129561
Grande       3574
Pequena       214
Name: count, dtype: int64

### Verificar o dataframe após as alterações feitas

In [13]:
df.head()

,ano,nivel_experiencia,contrato_emprego,cargo,salario,moeda_do_salario,salario_em_usd,residencia_empregado,tipo_trabalho,localizacao_empresa,tamanho_empresa
0,2025.0,Sênior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Média
1,2025.0,Sênior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Média
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Média
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Média
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Média

In [14]:
df.describe(include='object') # Para ver estatísticas descritivas de colunas categóricas

,nivel_experiencia,contrato_emprego,cargo,moeda_do_salario,residencia_empregado,tipo_trabalho,localizacao_empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Sênior,Tempo Integral,Data Scientist,USD,US,Presencial,US,Média
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [15]:
df.describe()

                 ano       salario  salario_em_usd
count  133339.000000  1.333490e+05   133349.000000
mean     2024.358770  1.632833e+05   157617.272098
std         0.680627  2.173860e+05    74288.363097
min      2020.000000  1.400000e+04    15000.000000
25%      2024.000000  1.060200e+05   106000.000000
50%      2024.000000  1.470000e+05   146206.000000
75%      2025.000000  1.990000e+05   198000.000000
max      2025.000000  3.040000e+07   800000.000000

    Palavra chave da primeira aula é: Pandas